Repository: FlameGemini/Ardel
Catalog: src/Ardel.Launcher/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_cn

# Settings_HomeWidgetsUseCurrentLocation
source: Use current location
ja_jp: 現在地を使用
zh_cn: 使用当前位置

# Settings_HomeWidgetsLocating
source: Getting location…
ja_jp: 位置情報を取得中…
zh_cn: 正在获取位置…

# Settings_HomeWidgetsLocationDenied
source: Location access was denied.
ja_jp: 位置情報へのアクセスが拒否されました。
zh_cn: 未获得位置权限。

# Settings_HomeWidgetsLocationFailed
source: Could not get location: {0}
ja_jp: 位置情報を取得できませんでした: {0}
zh_cn: 无法获取位置：{0}

# Settings_HomeWidgetsCurrentLocationLabel
source: Current location
ja_jp: 現在地
zh_cn: 当前位置

# Settings_HomeWidgetsUseFahrenheit
source: Use Fahrenheit (°F)
ja_jp: 華氏（°F）を使用
zh_cn: 使用华氏度（°F）

# Settings_HomeWidgetsRegionSet
source: Region set to {0}
ja_jp: 地域を {0} に設定しました
zh_cn: 地区已设为 {0}

# Home_WeatherNeedRegion
source: Set a region in Personalization → Home widgets
ja_jp: パーソナライズ → ホームウィジェットで地域を設定してください
zh_cn: 请在个性化 → 主页小组件中设置地区

# Home_WeatherLoading
source: Loading weather…
ja_jp: 天気を読み込み中…
zh_cn: 正在加载天气…

# Home_WeatherFailed
source: Weather unavailable
ja_jp: 天気を取得できません
zh_cn: 天气暂不可用

# Home_WeatherConditionTodayRange
source: {0} Today {1}
ja_jp: {0} 今日 {1}
zh_cn: {0} 今日 {1}

# Weather_Clear
source: Clear
ja_jp: 晴れ
zh_cn: 晴

# Weather_ClearNight
source: Clear night
ja_jp: 快晴の夜
zh_cn: 晴夜

# Weather_MainlyClear
source: Mostly clear
ja_jp: おおむね晴れ
zh_cn: 大部晴朗

# Weather_PartlyCloudy
source: Partly cloudy
ja_jp: 晴れ時々曇り
zh_cn: 多云

# Weather_Overcast
source: Overcast
ja_jp: 曇り
zh_cn: 阴

# Weather_Fog
source: Fog
ja_jp: 霧
zh_cn: 雾

# Weather_Drizzle
source: Drizzle
ja_jp: 霧雨
zh_cn: 毛毛雨

# Weather_FreezingDrizzle
source: Freezing drizzle
ja_jp: 着氷性の霧雨
zh_cn: 冻毛毛雨

# Weather_Rain
source: Rain
ja_jp: 雨
zh_cn: 雨

# Weather_FreezingRain
source: Freezing rain
ja_jp: 着氷性の雨
zh_cn: 冻雨

# Weather_Snow
source: Snow
ja_jp: 雪
zh_cn: 雪

# Weather_RainShowers
source: Showers
ja_jp: にわか雨
zh_cn: 阵雨

# Weather_SnowShowers
source: Snow showers
ja_jp: にわか雪
zh_cn: 阵雪

# Weather_Thunderstorm
source: Thunderstorm
ja_jp: 雷雨
zh_cn: 雷暴

# Weather_ThunderstormHail
source: Thunderstorm with hail
ja_jp: 雷雨（ひょう）
zh_cn: 雷暴伴冰雹

# Weather_Unknown
source: Weather
ja_jp: 天気
zh_cn: 天气

# About_Credit_OpenMeteo
source: Open-Meteo weather and geocoding APIs for the Home weather widget. No API key required.
ja_jp: ホームの天気ウィジェット用 Open-Meteo 天気・ジオコーディング API。API キー不要。
zh_cn: Open-Meteo 天气与地理编码 API，用于主页天气小组件。无需 API密钥。

# About_Credit_Nominatim
source: OpenStreetMap Nominatim search API for location lookup.
ja_jp: 位置情報検索のための OpenStreetMap Nominatim 検索 API。
zh_cn: OpenStreetMap Nominatim 搜索 API，用于城市位置查询。

# Settings_Subtitle
source: Personalization and launcher defaults — instances inherit these unless overridden.
ja_jp: 外観とランチャー既定 — インスタンスで上書きしない限り、以下が共通設定です。
zh_cn: 个性化与启动器默认项 — 实例未单独设置时使用下列配置。

# Settings_SectionAppearance
source: Personalization
ja_jp: パーソナライズ
zh_cn: 个性化

# Settings_SectionAppearanceDesc
source: Choose the interface language and accent theme applied across Ardel.
ja_jp: Ardel 全体に適用する表示言語とアクセントテーマを選びます。
zh_cn: 选择 Ardel 界面语言与全局强调色主题。

# Settings_SectionDefaults
source: Defaults
ja_jp: 既定設定
zh_cn: 默认配置

# Settings_SectionDefaultsDesc
source: Java, memory, download mirror, and Minecraft folder used when an instance has no override.
ja_jp: Java、メモリ、ダウンロードミラー、Minecraft フォルダ。インスタンス側で指定がない場合に使われます。
zh_cn: Java、内存、下载镜像与游戏目录；未在实例中覆盖时，所有实例共用这些值。

# Settings_SectionAbout
source: About
ja_jp: 情報
zh_cn: 关于

# Settings_SectionAboutDesc
source: Version, license, open-source credits, and terms of service.
ja_jp: Ardel のバージョン、ライセンス、謝辞、利用規約。
zh_cn: 版本、许可证、开源致谢与服务条款。

# About_Title
source: About
ja_jp: 情報
zh_cn: 关于

# About_Subtitle
source: A portable Minecraft launcher for Windows — local instances, offline play, and curated downloads.
ja_jp: Windows ネイティブの Minecraft ランチャー。コミュニティ連携と高い安定性に特化。
zh_cn: 面向 Windows 的便携 Minecraft 启动器——本地实例、离线游玩与精选下载。

# About_License
source: Ardel is distributed under OSL-3.0. You may use, modify, and redistribute it under the terms of that license.
ja_jp: Ardel は OSL-3.0 の下で配布されます。同ライセンスの条件に従い、利用・改変・再配布できます。
zh_cn: Ardel 以 OSL-3.0 分发。你可以在该许可证条款下使用、修改与再分发本软件。

# About_LicenseHeading
source: License
ja_jp: ライセンス
zh_cn: 许可证

# About_LegalHeading
source: Terms of Service
ja_jp: 利用規約
zh_cn: 服务条款

# About_LegalUpdated
source: Version {0} · Effective date: {1}
ja_jp: バージョン {0} · 発効日：{1}
zh_cn: 版本 {0} · 生效日期：{1}

# About_LegalIntro
source: The following terms apply to all users of Ardel. Read each section carefully; choosing a display language does not change your legal obligations.
ja_jp: 以下の条件は Ardel のすべての利用者に適用されます。各節をよくお読みください。表示言語の選択は法的義務を変えません。
zh_cn: 以下条款适用于所有 Ardel 用户。请仔细阅读各节内容；界面显示语言不会改变您的法律义务。

# About_LegalFeedback
source: Report a legal or compliance issue
ja_jp: 法的・コンプライアンス上の問題を報告
zh_cn: 反馈法律或合规问题

# About_CopyrightNoticeHeading
source: Copyright Notice
ja_jp: 著作権表示
zh_cn: 版权声明

# About_CopyrightNoticeBody
source: Copyright © 2026 FlameGemini. All rights reserved. Ardel is distributed under the Open Software License version 3.0 (OSL-3.0). Any modification, derivative work, or redistribution of this software must strictly comply with OSL-3.0 terms, including the mandatory availability of complete source code. Closed-source bundling, unauthorized commercial reselling, removal of copyright notices or author attribution, and intellectual property infringement are strictly prohibited. This project is not affiliated with, endorsed by, or sponsored by Mojang Studios or Microsoft Corporation. The author reserves all legal rights to enforce compliance and seek damages and legal costs via statutory DMCA procedures and applicable laws.
ja_jp: Copyright © 2026 FlameGemini. All rights reserved. Ardel は Open Software License version 3.0 (OSL-3.0) の下で配布されています。本ソフトウェアの改変、派生版の作成、または再配布を行う場合は、完全なソースコードの公開義務を含む OSL-3.0 の規約を厳格に遵守する必要があります。 クローズドソース化、無許可での商用販売、著作権表示やクレジットの削除、知的財産権の侵害は固く禁止されています。本プロジェクトは Mojang Studios または Microsoft Corporation とは一切関係なく、公認・提携されたものではありません。著作者は、DMCA および関連法令に基づき、権利侵害に対して法的措置を講じる権利を留保します。
zh_cn: Copyright © 2026 FlameGemini. 保留所有权利。 Ardel 基于开源软件许可协议 Open Software License version 3.0 (OSL-3.0) 分发。任何对本软件的修改、衍生开发或再分发，均须严格遵守 OSL-3.0 协议条款（包括但不限于必须公开完整源代码）。 严禁闭源打包、未经授权的商业化销售转售、抹除版权信息与署名声明，或以任何形式侵犯本项目知识产权。本项目与 Mojang Studios 或 Microsoft Corporation 无任何关联、赞助或背书关系。对于任何侵权及挑衅行为，作者保留通过法律途径与 DMCA 数字版权保护机制追究责任并索赔维权费用的一切法定权利。

# About_OpenNoticeFile
source: View NOTICE.txt
ja_jp: NOTICE.txt を表示
zh_cn: 查看 NOTICE.txt

# About_SourceLink
source: View source
ja_jp: ソースを見る
zh_cn: 查看源码

# About_RerunSetup
source: Run setup wizard again
ja_jp: セットアップを再実行
zh_cn: 重新运行设置向导

# About_OpenLink
source: Open
ja_jp: 開く
zh_cn: 打开

# About_CopyVersion
source: Copy version
ja_jp: バージョンをコピー
zh_cn: 复制版本号

# About_CreditsHeading
source: Acknowledgments
ja_jp: 謝辞
zh_cn: 致谢

# About_CreditsIntro
source: Third-party software and services that power Ardel. Tap a row to open its home page.
ja_jp: Ardel が利用するサードパーティのライブラリ・サービス・フォントです（1 ページに掲載）。名称の権利は各作者に帰属します。
zh_cn: 为 Ardel 提供能力的第三方软件与服务。点击条目可打开其主页。

# About_LibrariesHeading
source: Libraries
ja_jp: ライブラリ
zh_cn: 库

# About_ServicesHeading
source: Services & APIs
ja_jp: サービス / API
zh_cn: 服务与 API

# About_FontsHeading
source: Fonts
ja_jp: フォント
zh_cn: 字体

# About_Credit_CmlLib
source: Minecraft launch and install core by CmlLib / AlphaBs.
ja_jp: Minecraft 起動・インストールコア（CmlLib / AlphaBs）。
zh_cn: Minecraft 启动与安装核心，由 CmlLib / AlphaBs 提供。

# About_Credit_CmlLibForge
source: Forge and NeoForge installer modules by CmlLib contributors.
ja_jp: Forge / NeoForge インストーラーモジュール（CmlLib 貢献者）。
zh_cn: Forge / NeoForge 安装模块，由 CmlLib 贡献者维护。

# About_Credit_OptifineInstaller
source: Community helper for OptiFine installation workflows.
ja_jp: OptiFine インストール作業向けのコミュニティ補助コンポーネント。
zh_cn: 用于 OptiFine 安装流程的社区辅助组件。

# About_Credit_CommunityToolkit
source: .NET Community Toolkit MVVM helpers for observable UI state.
ja_jp: UI 状態のための .NET Community Toolkit MVVM。
zh_cn: .NET Community Toolkit MVVM，用于可观察的界面状态。

# About_Credit_AuthlibInjector
source: Offline skin relay agent by yushijinhun.
ja_jp: オフラインスキン中継 agent（yushijinhun）。
zh_cn: 离线皮肤中继 agent，由 yushijinhun 提供。

# About_Credit_MinecraftSkinRender
source: Minecraft skin rendering component and 3D head generator by Coloryr.
ja_jp: Coloryr による Minecraft スキン描画コンポーネントおよび 3D ヘッドジェネレーター。
zh_cn: Minecraft 皮肤与 3D 头像渲染组件，由 Coloryr 提供。

# About_Credit_SkiaSharp
source: Cross-platform 2D graphics API based on Google's Skia, used for skin rendering.
ja_jp: スキン描画に使用される、Google の Skia に基づくクロスプラットフォーム 2D グラフィックス API。
zh_cn: 基于 Google Skia 的跨平台 2D 图形库，用于皮肤图像合成与渲染。

# About_Credit_XboxAuthNet
source: Xbox Live authentication and MSAL token integration by CmlLib.
ja_jp: CmlLib による Xbox Live 認証および MSAL トークン統合。
zh_cn: Xbox Live 认证与 MSAL 令牌集成库，由 CmlLib 提供。

# About_Credit_BmclApi
source: Optional Asia-friendly download mirror for Minecraft files, operated by bangbang93.
ja_jp: アジア向けに有利な任意の Minecraft ダウンロードミラー（bangbang93）。
zh_cn: 可选的 Minecraft 下载镜像，对亚洲网络更友好，由 bangbang93 运营。

# About_Credit_Adoptium
source: Eclipse Adoptium API for automated Temurin OpenJDK runtime downloads.
ja_jp: Temurin OpenJDK ランタイムの自動ダウンロードのための Eclipse Adoptium API。
zh_cn: Eclipse Adoptium API，用于自动下载 Eclipse Temurin OpenJDK 运行时。

# About_Credit_MsDi
source: Microsoft.Extensions dependency injection used for launcher services.
ja_jp: ランチャーサービス組み立て用の Microsoft.Extensions DI。
zh_cn: Microsoft.Extensions 依赖注入，用于启动器服务组装。

# About_Credit_Wasdk
source: Windows App SDK and WinUI 3 shell framework by Microsoft.
ja_jp: Windows App SDK / WinUI 3（Microsoft）。
zh_cn: Windows App SDK 与 WinUI 3 界面框架（Microsoft）。

# About_Credit_DotNet
source: .NET runtime and base class libraries used by the launcher.
ja_jp: ランチャーが使用する .NET ランタイムと基本クラス ライブラリ。
zh_cn: 启动器使用的 .NET 运行时与基础类库。

# About_Credit_Modrinth
source: Mod / modpack catalog and downloads via the Modrinth API.
ja_jp: Modrinth API による Mod / 統合パックの検索とダウンロード。
zh_cn: 通过 Modrinth API 检索模组 / 整合包并下载。

# About_Credit_CurseForge
source: CurseForge catalog access through the community curse.tools proxy.
ja_jp: コミュニティ curse.tools 経由の CurseForge カタログ。
zh_cn: 通过社区 curse.tools 代理访问 CurseForge 目录。

# About_Credit_JetBrainsMono
source: Packaged monospace (SIL OFL 1.1). Home greeting and clock in every language.
ja_jp: 同梱の等幅フォント（SIL OFL 1.1）。全言語のホーム挨拶と時計に使用。
zh_cn: 打包的等宽字体（SIL OFL 1.1）。各语言主页问候与时钟均使用。

# About_Credit_Consolas
source: English UI body and display default; also used in the game log panel. System font — not redistributed.
ja_jp: 英語 UI の本文フォント。ゲームログパネルでも使用。システムフォント（同梱しません）。
zh_cn: 英文界面正文字体；游戏日志面板也使用。系统字体，不随应用分发。

# About_Credit_SegoeUiVariable
source: Non-English shell UI. System font — not redistributed.
ja_jp: 非英語 UI シェル。システムフォント（同梱しません）。
zh_cn: 非英文界面外壳字体。系统字体，不随应用分发。

# About_Credit_YaHeiUi
source: Simplified Chinese UI. System font — not redistributed.
ja_jp: 簡体字中国語 UI。システムフォント（同梱しません）。
zh_cn: 简体中文界面。系统字体，不随应用分发。

# About_Credit_JhengHeiUi
source: Traditional Chinese UI. System font — not redistributed.
ja_jp: 繁体字中国語 UI。システムフォント（同梱しません）。
zh_cn: 繁体中文界面。系统字体，不随应用分发。

# About_Credit_YuGothicUi
source: Japanese UI. System font — not redistributed.
ja_jp: 日本語 UI。システムフォント（同梱しません）。
zh_cn: 日文界面。系统字体，不随应用分发。

# About_Credit_MeiryoUi
source: Japanese UI fallback. System font — not redistributed.
ja_jp: 日本語 UI のフォールバック。システムフォント（同梱しません）。
zh_cn: 日文界面后备字体。系统字体，不随应用分发。

# About_Credit_MalgunGothic
source: Korean UI. System font — not redistributed.
ja_jp: 韓国語 UI。システムフォント（同梱しません）。
zh_cn: 韩文界面。系统字体，不随应用分发。

# About_Credit_SegoeUi
source: General UI fallback across locales. System font — not redistributed.
ja_jp: 各言語共通の UI フォールバック。システムフォント（同梱しません）。
zh_cn: 各语言通用界面后备字体。系统字体，不随应用分发。

# About_Credit_SegoeFluentIcons
source: Icon glyphs in the game log panel. System font — not redistributed.
ja_jp: ゲームログパネルのアイコン字形。システムフォント（同梱しません）。
zh_cn: 游戏日志面板图标字形。系统字体，不随应用分发。

# About_OfficialPurchaseEncourage
source: We encourage purchasing and activating genuine Minecraft: Java Edition through official channels such as the Microsoft Store or minecraft.net.
ja_jp: Microsoft Store または minecraft.net などの公式チャンネルを通じて Minecraft: Java Edition の正規版を購入・有効化することを推奨します。
zh_cn: 我们鼓励通过 Microsoft Store、minecraft.net 等官方渠道购买并激活 Minecraft: Java 版正版。

# Oobe_Previous
source: Previous
ja_jp: 戻る
zh_cn: 上一步

# Oobe_Next
source: Next
ja_jp: 次へ
zh_cn: 下一步

# Oobe_Finish
source: Get started
ja_jp: 始める
zh_cn: 开始使用

# Oobe_StepLanguage_Title
source: Choose your language
ja_jp: 言語を選択
zh_cn: 选择语言

# Oobe_StepLanguage_Subtitle
source: You can change this later in Settings.
ja_jp: 後から設定で変更できます。
zh_cn: 之后可在设置中更改。

# Oobe_StepWelcome_Title
source: Welcome to Ardel Launcher
ja_jp: Ardel ランチャーへようこそ
zh_cn: 欢迎使用 Ardel 启动器

# Oobe_StepWelcome_Subtitle
source: We're glad you chose our product.
ja_jp: 当製品をお選びいただきありがとうございます。
zh_cn: 感谢选择我们的产品。

# Oobe_StepLicense_Title
source: Terms of use
ja_jp: 利用規約
zh_cn: 使用条款

# Oobe_StepLicense_Agree
source: I have read and agree to the terms
ja_jp: 規約を読み、同意します
zh_cn: 我已阅读并同意上述条款

# Oobe_StepTheme_Title
source: Pick a theme
ja_jp: テーマを選ぶ
zh_cn: 选择主题

# Oobe_StepTheme_Subtitle
source: Preview applies to the launcher and this setup.
ja_jp: プレビューはランチャーとこのセットアップにすぐ反映されます。
zh_cn: 预览会立即应用到启动器与本向导。

# Oobe_StepTutorial_Title
source: Quick start
ja_jp: クイックスタート
zh_cn: 快速上手

# Oobe_StepTutorial_Subtitle
source: Follow these five steps in order to play for the first time.
ja_jp: 次の5ステップを順に進めれば、初めてゲームを起動できます。
zh_cn: 按顺序完成以下五步，即可首次启动游戏。

# Oobe_StepTutorial_Step1_Title
source: Open Download
ja_jp: ダウンロードを開く
zh_cn: 打开下载

# Oobe_StepTutorial_Step1_Detail
source: In the sidebar, open Download to browse available Minecraft versions.
ja_jp: サイドバーで「ダウンロード」を開き、利用可能な Minecraft バージョンを確認します。
zh_cn: 在侧栏打开「下载」，浏览可用的 Minecraft 版本。

# Oobe_StepTutorial_Step2_Title
source: Install a version
ja_jp: バージョンをインストール
zh_cn: 安装版本

# Oobe_StepTutorial_Step2_Detail
source: Pick a release and start the install. A game profile is created automatically.
ja_jp: リリースを選んでインストールを開始します。ゲームプロファイルは自動で作成されます。
zh_cn: 选择要安装的版本并开始安装，启动器会自动创建游戏实例。

# Oobe_StepTutorial_Step3_Title
source: Wait for the download
ja_jp: ダウンロード完了を待つ
zh_cn: 等待下载完成

# Oobe_StepTutorial_Step3_Detail
source: Let the download task finish. Track progress from the sidebar indicator.
ja_jp: ダウンロードが終わるまで待ちます。サイドバーのインジケーターで進捗を確認できます。
zh_cn: 等待下载任务结束，可在侧栏下载指示器中查看进度。

# Oobe_StepTutorial_Step4_Title
source: Sign in to an account
ja_jp: アカウントにサインイン
zh_cn: 登录账户

# Oobe_StepTutorial_Step4_Detail
source: Open Account, add your Minecraft account, and tap the card to sign in.
ja_jp: 「アカウント」で Minecraft アカウントを追加し、カードをタップしてサインインします。
zh_cn: 打开「账户」，添加 Minecraft 账户并点击卡片完成登录。

# Oobe_StepTutorial_Step5_Title
source: Launch the game
ja_jp: ゲームを起動
zh_cn: 启动游戏

# Oobe_StepTutorial_Step5_Detail
source: Open Profiles and tap Launch on your install. Minecraft opens in a new window once launch starts.
ja_jp: 「プロファイル」でインストール済み項目の「起動」をタップします。起動後、Minecraft が新しいウィンドウで開きます。
zh_cn: 打开「实例」，在安装项上点击「启动」。游戏将在新窗口中打开。

# Oobe_StepBreak_Title
source: Water bar
ja_jp: ウォーターバー
zh_cn: 水吧

# Oobe_StepAccount_Title
source: Add an offline account
ja_jp: オフラインアカウントを追加
zh_cn: 添加离线账户

# Oobe_StepAccount_Subtitle
source: Optional — you can add more accounts later.
ja_jp: 任意 — 後からアカウントページで追加できます。
zh_cn: 可选 — 之后可在账户页添加更多。

# Oobe_StepHydrate_Title
source: Water
ja_jp: 水
zh_cn: 水

# Oobe_StepComplete_Title
source: You're all set
ja_jp: 準備完了
zh_cn: 一切就绪

# Oobe_StepComplete_Subtitle
source: Tap Finish to enter Ardel, then download a version, sign in, and launch when you're ready.
ja_jp: 「完了」をタップして Ardel に入り、上の手順どおりにダウンロード、サインイン、起動を行ってください。
zh_cn: 点击「完成」进入启动器，按上方步骤下载版本、登录账户并启动游戏即可。

# Version_Vanilla
source: Vanilla
ja_jp: バニラ
zh_cn: 原版

# Version_Custom
source: Custom
ja_jp: カスタム
zh_cn: 自定义

# Java_SourceCommon
source: Common
ja_jp: 一般
zh_cn: 常见路径

# Java_SourceRegistry
source: Registry
ja_jp: レジストリ
zh_cn: 注册表

# Java_SourceRegistryNamed
source: Registry ({0})
ja_jp: レジストリ（{0}）
zh_cn: 注册表（{0}）

# Progress_FileFallback
source: file
ja_jp: ファイル
zh_cn: 文件

# Install_Title
source: Install {0}
ja_jp: {0} をインストール
zh_cn: 安装 {0}

# Install_VersionName
source: Version name
ja_jp: バージョン名
zh_cn: 版本名称

# Install_VersionNamePlaceholder
source: Folder name under versions/
ja_jp: versions/ 下のフォルダー名
zh_cn: versions/ 下的文件夹名

# Install_Loader
source: Also install
ja_jp: あわせてインストール
zh_cn: 同时安装

# Install_LoaderNone
source: Vanilla only
ja_jp: バニラのみ
zh_cn: 仅原版

# Install_LoaderExclusiveHint
source: Forge, Fabric, NeoForge, and OptiFine cannot be combined — pick at most one.
ja_jp: Forge・Fabric・NeoForge・OptiFine は併用できません — 最大で 1 つ選んでください。
zh_cn: Forge、Fabric、NeoForge 与 OptiFine 不能混装 — 最多选一个。

# Install_LoaderVersion
source: Loader version
ja_jp: ローダーバージョン
zh_cn: 加载器版本

# Install_OptiFineVersion
source: OptiFine version
ja_jp: OptiFine バージョン
zh_cn: OptiFine 版本

# Install_LoadingLoaders
source: Loading loader versions…
ja_jp: ローダーバージョンを読み込み中…
zh_cn: 正在加载加载器版本…

# Install_LoadingOptiFine
source: Loading OptiFine versions…
ja_jp: OptiFine バージョンを読み込み中…
zh_cn: 正在加载 OptiFine 版本…

# Install_NoLoaders
source: No loader builds found for this Minecraft version.
ja_jp: この Minecraft バージョン向けのローダーが見つかりません。
zh_cn: 未找到适用于此 Minecraft 版本的加载器构建。

# Install_NoOptiFine
source: No OptiFine builds found for this Minecraft version.
ja_jp: この Minecraft バージョン向けの OptiFine が見つかりません。
zh_cn: 未找到适用于此 Minecraft 版本的 OptiFine 构建。

# Install_LoaderCount
source: {0} builds available
ja_jp: {0} 件のビルドが利用可能
zh_cn: {0} 个可用构建

# Install_OptiFineCount
source: {0} OptiFine builds available
ja_jp: {0} 件の OptiFine ビルドが利用可能
zh_cn: {0} 个可用 OptiFine 构建

# Install_LoaderLoadFailed
source: Could not load loader versions: {0}
ja_jp: ローダーバージョンを読み込めませんでした: {0}
zh_cn: 无法加载加载器版本：{0}

# Install_OptiFineLoadFailed
source: Could not load OptiFine versions: {0}
ja_jp: OptiFine バージョンを読み込めませんでした: {0}
zh_cn: 无法加载 OptiFine 版本：{0}

# Install_SelectLoaderVersion
source: Select a loader version.
ja_jp: ローダーバージョンを選択してください。
zh_cn: 请选择加载器版本。

# Install_SelectOptiFineVersion
source: Select an OptiFine version.
ja_jp: OptiFine バージョンを選択してください。
zh_cn: 请选择 OptiFine 版本。

# Install_FabricApi
source: Also install Fabric API
ja_jp: Fabric API もインストール
zh_cn: 同时安装 Fabric API

# Install_FabricApiHint
source: Downloads Fabric API into this version's mods folder (Modrinth, then CurseForge).
ja_jp: このバージョンの mods フォルダーに Fabric API をダウンロードします（Modrinth 優先、次に CurseForge）。
zh_cn: 将 Fabric API 下载到该版本的 mods 文件夹（优先 Modrinth，其次 CurseForge）。

# Download_AlreadyRunning
source: {0} is already in the task list
ja_jp: {0} はすでにタスク一覧にあります
zh_cn: {0} 已在任务列表中

# Conflict_WithAddon
source: {0} is incompatible with {1}.
ja_jp: {0} は {1} と互換性がありません。
zh_cn: {0} 与 {1} 不兼容。

# Conflict_Incompatible
source: These addons cannot be combined.
ja_jp: これらのアドオンは併用できません。
zh_cn: 这些附加组件不能一起安装。

# LoaderTag_Stable
source: stable
ja_jp: 安定
zh_cn: 稳定

# LoaderTag_Unstable
source: unstable
ja_jp: 不安定
zh_cn: 不稳定

# LoaderTag_Recommended
source: recommended
ja_jp: 推奨
zh_cn: 推荐

# LoaderTag_Latest
source: latest
ja_jp: 最新
zh_cn: 最新

# FabricApi_Resolving
source: Finding Fabric API…
ja_jp: Fabric API を検索中…
zh_cn: 正在查找 Fabric API…

# FabricApi_Downloading
source: Downloading Fabric API ({1}): {0}
ja_jp: Fabric API をダウンロード中（{1}）: {0}
zh_cn: 正在下载 Fabric API（{1}）：{0}

# FabricApi_Installed
source: Fabric API ready ({1}): {0}
ja_jp: Fabric API 準備完了（{1}）: {0}
zh_cn: Fabric API 就绪（{1}）：{0}

# FabricApi_NotFound
source: No Fabric API build found for Minecraft {0}.
ja_jp: Minecraft {0} 向けの Fabric API が見つかりません。
zh_cn: 未找到适用于 Minecraft {0} 的 Fabric API。

# FabricApi_ResolveFailed
source: Could not resolve Fabric API for {0}: {1}
ja_jp: {0} の Fabric API を解決できませんでした: {1}
zh_cn: 无法解析 {0} 的 Fabric API：{1}

# Error_BmclSetupFailed
source: Failed to configure BMCLAPI mirrors.
ja_jp: BMCLAPI ミラーの設定に失敗しました。
zh_cn: 配置 BMCLAPI 镜像失败。

# Error_LoaderEmptyId
source: Mod loader install returned an empty version id.
ja_jp: MOD ローダーのインストールが空のバージョン ID を返しました。
zh_cn: 模组加载器安装返回了空的版本 ID。

# Error_FabricProfileInvalid
source: Fabric profile was not created correctly. Pick a version name different from the Minecraft id and try again.
ja_jp: Fabric プロファイルが正しく作成されませんでした。Minecraft ID と異なるバージョン名を選んで再試行してください。
zh_cn: Fabric 配置未正确创建。请使用与 Minecraft 版本 ID 不同的名称后重试。

# Error_JavaNotFound
source: Configured Java path was not found.
ja_jp: 設定された Java パスが見つかりません。
zh_cn: 配置的 Java 路径不存在。

# Error_JavaTooOld
source: Minecraft {0} requires Java {1}+, but selected Java is {2}.
ja_jp: Minecraft {0} には Java {1}+ が必要ですが、選択中の Java は {2} です。
zh_cn: Minecraft {0} 需要 Java {1}+，但所选 Java 为 {2}。

# Error_JavaExeNotFound
source: java.exe not found.
ja_jp: java.exe が見つかりません。
zh_cn: 未找到 java.exe。

# Error_JavaProcessStart
source: Failed to start process: {0}
ja_jp: プロセスを起動できませんでした: {0}
zh_cn: 无法启动进程：{0}

# Error_JavaVersionParse
source: Unable to parse Java version from output:{0}{1}
ja_jp: 出力から Java バージョンを解析できません:{0}{1}
zh_cn: 无法从输出解析 Java 版本：{0}{1}

# Error_ProcessStartFailed
source: Failed to start the Minecraft process.
ja_jp: Minecraft プロセスを起動できませんでした。
zh_cn: 无法启动 Minecraft 进程。

# Error_VersionFolderNotFound
source: Version folder not found: {0}
ja_jp: バージョンフォルダーが見つかりません: {0}
zh_cn: 未找到版本文件夹：{0}

# Error_VersionAlreadyExists
source: Version already exists: {0}
ja_jp: バージョンは既に存在します: {0}
zh_cn: 版本已存在：{0}

# Error_VersionDeleteLocked
source: Could not delete "{0}" — close the game and any open folders, then try again.
ja_jp: 「{0}」を削除できません — ゲームと開いているフォルダーを閉じてから再試行してください。
zh_cn: 无法删除“{0}” — 请关闭游戏和已打开的文件夹后再试。

# Error_JavaDownloadFailed
source: Failed to download Java {0}: {1}
ja_jp: Java {0} のダウンロードに失敗しました: {1}
zh_cn: 下载 Java {0} 失败：{1}

# Error_AlreadyInstalling
source: Install already in progress.
ja_jp: インストールは既に進行中です。
zh_cn: 安装已在进行中。

# Error_FileDownloadFailed
source: Failed to download {0}
ja_jp: {0} のダウンロードに失敗しました
zh_cn: 下载失败：{0}

# Error_TimedOut
source: Timed out
ja_jp: タイムアウト
zh_cn: 超时

# Error_Unknown
source: unknown
ja_jp: 不明
zh_cn: 未知

# Validate_VersionEmpty
source: Version name cannot be empty.
ja_jp: バージョン名を空にできません。
zh_cn: 版本名称不能为空。

# Validate_NameLeadingSpace
source: Name cannot start with a space.
ja_jp: 名前をスペースで始められません。
zh_cn: 名称不能以空格开头。

# Validate_NameTrailingSpace
source: Name cannot end with a space.
ja_jp: 名前をスペースで終えられません。
zh_cn: 名称不能以空格结尾。

# Validate_NameTrailingDot
source: Name cannot end with a period.
ja_jp: 名前をピリオドで終えられません。
zh_cn: 名称不能以句点结尾。

# Validate_NameTooLong
source: Name can be at most {0} characters.
ja_jp: 名前は最大 {0} 文字です。
zh_cn: 名称最多 {0} 个字符。

# Validate_NameInvalidChar
source: Name cannot contain: {0}
ja_jp: 名前に使用できない文字: {0}
zh_cn: 名称不能包含：{0}

# Validate_NameReserved
source: Name cannot be {0}.
ja_jp: 名前に {0} は使用できません。
zh_cn: 名称不能为 {0}。

# Validate_NameNtfs83
source: Name cannot use this special format.
ja_jp: この特殊な形式の名前は使用できません。
zh_cn: 名称不能使用此特殊格式。

# Validate_VersionExists
source: A version folder with this name already exists.
ja_jp: 同じ名前のバージョンフォルダーが既に存在します。
zh_cn: 已存在同名版本文件夹。

# Validate_LoaderNameEqualsMc
source: Loader profiles cannot use the same name as the Minecraft version (that overwrites vanilla). Try a name like 1.21.1-fabric.
ja_jp: ローダープロファイルは Minecraft バージョンと同じ名前にできません（バニラを上書きします）。1.21.1-fabric のような名前を試してください。
zh_cn: 加载器档案不能与 Minecraft 版本同名（会覆盖原版）。可尝试如 1.21.1-fabric。

# Validate_PlayerEmpty
source: Player name cannot be empty.
ja_jp: プレイヤー名を空にできません。
zh_cn: 玩家名不能为空。

# Validate_PlayerQuote
source: Player name cannot contain quotes (").
ja_jp: プレイヤー名に引用符（"）を含められません。
zh_cn: 玩家名不能包含引号（"）。

# Validate_PlayerTooLong
source: Player name must be 16 characters or fewer.
ja_jp: プレイヤー名は 16 文字以下にしてください。
zh_cn: 玩家名最多 16 个字符。

# Validate_PlayerLength
source: Player name must be 3–16 characters.
ja_jp: プレイヤー名は 3～16 文字にしてください。
zh_cn: 玩家名须为 3–16 个字符。

# Validate_PlayerCharset
source: Invalid characters in player name.
ja_jp: プレイヤー名に使えない文字があります。
zh_cn: 游戏名包含无效字符。

# Validate_SkinNameInvalid
source: Skin name cannot contain path characters.
ja_jp: スキン名にパス文字は使えません。
zh_cn: 皮肤名不能包含路径字符。

# Default_PlayerName
source: Player
ja_jp: プレイヤー
zh_cn: 玩家

# Mod_DetailChannelAlpha
source: Alpha
ja_jp: アルファ
